feat: update the readme file for the abstraction with mermaid diagramms
